In [1]:
# Imports
import pandas as pd
import sklearn
from sqlalchemy import create_engine

In [2]:
# Connect to db atelierdata
engine = create_engine("mysql+pymysql://root:supdevinci@192.168.1.84/atelierdata", echo=True)

In [6]:
# Extract table countsclean
df = pd.read_sql('SELECT * FROM countsclean', engine)

2024-03-22 17:50:59,510 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-22 17:50:59,512 INFO sqlalchemy.engine.Engine DESCRIBE `atelierdata`.`SELECT * FROM countsclean`
2024-03-22 17:50:59,513 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-03-22 17:50:59,515 INFO sqlalchemy.engine.Engine SELECT * FROM countsclean
2024-03-22 17:50:59,517 INFO sqlalchemy.engine.Engine [raw sql] {}
2024-03-22 17:51:00,337 INFO sqlalchemy.engine.Engine ROLLBACK

In [8]:
df.head()

,datetime,year,month,day,hour,counts,name_lower
0,2016-04-23 10:00:00,2016,4,23,10,25.0,boulevard georges pompidou
1,2016-04-23 15:00:00,2016,4,23,15,20.0,boulevard georges pompidou
2,2016-04-23 22:00:00,2016,4,23,22,6.0,boulevard georges pompidou
3,2016-04-23 23:00:00,2016,4,23,23,3.0,boulevard georges pompidou
4,2016-04-24 03:00:00,2016,4,24,3,12.0,boulevard georges pompidou